export type Talk = {
  title: string
  speaker: string
  timeEnd: number
}

export const allTalks: Talk[] = [
  {
    title: 'А доки где? Пишем продуктовую документацию',
    speaker: 'Егор Левченко',
    timeEnd: 1777575600000,
  },
  {
    title:
      'Перформанс без головной боли: Системная оптимизация фронтенда в большой команде',
    speaker: 'Мирзоев Руслан',
    timeEnd: 1777575600000,
  },
  {
    title: 'Секретная жизнь фотографий в Клубе Тайных Покупателей X5',
    speaker: 'Артур Басак',
    timeEnd: 1777575600000,
  },
  {
    title: 'LLM в продакшене: от идеи до внедрения за неделю',
    speaker: 'Артём Шкуренко',
    timeEnd: 1777575600000,
  },
  {
    title: 'Веб-компоненты: плохая реализация хорошей идеи',
    speaker: 'Евгений Кучерявый',
    timeEnd: 1777575600000,
  },
  {
    title:
      'Вторая жизнь инженерных практик: как ИИ делает сложные подходы наконец-то удобными',
    speaker: 'Вадим Царегородцев',
    timeEnd: 1777575600000,
  },
  {
    title: 'Круглый стол "Инженерная культура и переход на «бигтех-рельсы»"',
    speaker: 'Иван Сизов, Роман Троицкий, Глеб Михеев, Михаил Хромов',
    timeEnd: 1777575600000,
  },
]
